**1. Import 'titanic.csv' as pd.DataFrame and look at first 5 lines.**

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')

In [24]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

**2. How many passengers belonged to Pclass 3?**

In [14]:
len(df[df.Pclass == 3])

491

**2.1 What was the mean age for Pclass 1,2 and 3?**

In [30]:
for class_ in [1, 2, 3]:
    mean = df[df.Pclass == class_].Age.mean()
    print(f'{class_}: {mean}')

1: 38.233440860215055
2: 29.87763005780347
3: 25.14061971830986

In [33]:
n = 1
while n < 4:
    mean = df[df.Pclass == n].Age.mean()
    print(f'{n}: {mean}')
    n += 1

1: 38.233440860215055
2: 29.87763005780347
3: 25.14061971830986

**3. How many people from Pclass 3 survived?**

In [26]:
len(df[(df.Pclass == 3) & (df.Survived == 1)])

119

**4. Show first 5 rows of subtable containing only Pclass and Survived.**

In [34]:
df[['Pclass', 'Survived']][:5]

   Pclass  Survived
0       3         0
1       1         1
2       3         1
3       1         1
4       3         0

In [35]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**5. Plot 4 graphs in 1 figure (2x2). Age distribution for females who survied/died and same two plots for males (drop all NaN lines).**"

In [43]:
fs = df[(df.Sex == 'female') & (df.Survived == 1)].Age.dropna()
fd = df[(df.Sex == 'female') & (df.Survived == 0)].Age.dropna()

ms = df[(df.Sex == 'male') & (df.Survived == 1)].Age.dropna()
md = df[(df.Sex == 'male') & (df.Survived == 0)].Age.dropna()

In [42]:
import matplotlib.pyplot as plt

fig, ((ax1, ax2), (ax3, ax4)) = plt.subplot(2,2)

ax1.hist(ms, color='green')
ax1.set(title='Male survivors')

1      38.0
2      26.0
3      35.0
8      27.0
9      14.0
10      4.0
11     58.0
15     55.0
22     15.0
25     38.0
39     14.0
43      3.0
44     19.0
52     49.0
53     29.0
56     21.0
58      5.0
61     38.0
66     29.0
68     17.0
79     30.0
84     17.0
85     33.0
88     23.0
98     34.0
106    21.0
123    32.5
133    29.0
136    19.0
141    22.0
       ...
765    51.0
774    54.0
777     5.0
779    43.0
780    13.0
781    17.0
786    18.0
796    49.0
797    31.0
801    31.0
809    33.0
820    52.0
823    27.0
829    62.0
830    15.0
835    39.0
842    30.0
853    16.0
855    18.0
856    45.0
858    24.0
862    48.0
865    42.0
866    27.0
871    47.0
874    28.0
875    15.0
879    56.0
880    25.0
887    19.0
Name: Age, Length: 197, dtype: float64

**6.  Try to use groupby method to explore how many people survived (in %) or died from all separate Pclasses. Save result table to a new variable.**


**7. Plot (use object oriented style) surviving rate for diferent Pclasses as a bar plot. Use some ylabel,xlabel and title to describe your graph. Don't use legend.**